Revit 2027 API
FailuresProcessingEventArgs.GetFailuresAccessor Method
 Provides access to the failure information in the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailuresAccessor GetFailuresAccessor()
Public Function GetFailuresAccessor As FailuresAccessor
public:
FailuresAccessor^ GetFailuresAccessor()
member GetFailuresAccessor : unit -> FailuresAccessor
Return Value
FailuresAccessor
 The accessor to the failures in the document.
See Also
Reference
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace